const hundred = {
    '1':'сто',
    '2':'двісті',
    '3':'триста',
    '4':'чотириста',
    '5':'п`ятьсот',
    '6':'шістьсот',
    '7':'сімсот',
    '8':'вісімсот',
    '9':'дев`ятьсот'
    };
const decades = {
    '0': " ",
    '2':'двадцять',
    '3':'тридцять',
    '4':'сорок',
    '5':'п`ятдесят',
    '6':'шістдесят',
    '7':'сімдесят',
    '8':'вісімдесят',
    '9':'дев`яносто'
    };
const single = {
    '0': " ",
    '1':'одна гривня',
    '2':'дві гривні',
    '3':'три гривні',
    '4':'чотири гривні',
    '5':'п`ять гривень',
    '6':'шість гривень',
    '7':'сім гривень',
    '8':'вісім гривень',
    '9':'дев`ять гривень'
    };

const teenth = {
    '10':'десять гривень',
    '1':'оддинадцять гривень',
    '2':'дванадцять гривень',
    '3':'тринадцять гривень',
    '4':'чотирнадцять гривень',
    '5':'п`ятнадцять гривень',
    '6':'шістнадцять гривень',
    '7':'сімнадцять гривень',
    '8':'вісімнадцять гривень',
    '9':'дев`ятнадцять гривень'
    };
    
    let number = prompt ('Введіть число');
    let arrnumber = [...number];
          console.log (`Ваше число = ${arrnumber}`);
          console.log (`lenght = ${arrnumber.length}`);